       IDENTIFICATION DIVISION.
       PROGRAM-ID. FILES.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.
       OBJECT-COMPUTER.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT STUDENT ASSIGN TO DISK
           ORGANIZATION IS SEQUENTIAL
           ACCESS MODE IS SEQUENTIAL.
       DATA DIVISION.
       FILE SECTION.
       FD STUDENT
           LABEL RECORDS ARE STANDARD
           VALUE OF FILE-ID IS "STUDENT2.DAT"
           DATA RECORD IS STUDENT-REC.
       01 STUDENT-REC.
        02 RNO PIC X(3).
        02 NAME PIC A(20).
        02 MARKS PIC 9(4).
       WORKING-STORAGE SECTION.
       77 CHOICE PIC X.
       PROCEDURE DIVISION.
       OPEN-PARA.
           OPEN OUTPUT STUDENT.
       PROCESS-PARA.
           DISPLAY "ENTER ROLL NO: ".
           ACCEPT RNO.
           DISPLAY "ENTER NAME: ".
           ACCEPT NAME.
           DISPLAY "ENTER TOTAL MARKS: ".
           ACCEPT MARKS.

           WRITE STUDENT-REC.

           DISPLAY "DO YOU WANT TO CONTINUE WITH ENTRIES? (Y/N) ".
           ACCEPT CHOICE.
           IF CHOICE = "Y"
                GO TO PROCESS-PARA.
           CLOSE STUDENT.
           STOP RUN.
