       IDENTIFICATION DIVISION.
       PROGRAM-ID. FILES.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.
       OBJECT-COMPUTER.
       FILE-CONTROL.
           SELECT STUDENT ASSIGN TO DISK
           ORGANIZATION IS SEQUENTIAL
           ACCESS MODE IS SEQUENTIAL.
       DATA DIVISION.
       FILE SECTION.
       FD STUDENT
           LABEL RECORDS ARE STANDARD
           VALUE OF FILE-ID "STUDENT.DAT"
           DATA RECORD IS STUDENT-REC.
       01 STUDENT-REC.
        02 RNO PIC 9(3).
        02 NAME PIC A(20).
        02 MARKS PIC 9(4).
       WORKING-STORAGE SECTION.
       77 TRNO PIC 9(3).
       77 CHOICE PIC X.
       PROCEDURE DIVISION.
       OPEN-PARA.
           OPEN INPUT STUDENT.
       PROCESS-PARA.
           READ STUDENT AT END GO TO CLOSE-PARA.
           DISPLAY "ROLL NO: ", RNO.
           DISPLAY "NAME: ", NAME.
           DISPLAY "MARKS: ", MARKS.
           DISPLAY "DO YOU WANT TO CONTINUE READING? (Y/N): ".
           ACCEPT CHOICE.
           IF CHOICE = "Y"
                GO TO PROCESS-PARA.
       CLOSE-PARA.
           CLOSE STUDENT.
           STOP RUN.
