       IDENTIFICATION DIVISION.
       PROGRAM-ID. SEQUENTIAL.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.
       OBJECT-COMPUTER.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL
       SELECT STUDENT ASSIGN TO DISK
       ORGANIZATION IS SEQUENTIAL
       ACCESS MODE IS SEQUENTIAL.
       DATA DIVISION.
       FILE SECTION.
       FD STUDENT
           LABEL RECORDS ARE STANDARD
           VALUE OF FILE-ID IS "STUDENT.DAT "
           DATA RECORD IS STUDENT-REC.
       01 STUDENT-REC.
           02 RNO PIC 9(2).
           02 NAME PIC X(20).
           02 MARKS PIC 9(4).
       WORKING-STORAGE SECTION.
       77 CH PIC X.
       PROCEDURE DIVISION.
       OPEN-PARA.
           OPEN OUTPUT STUDENT.
       PROCESS-PARA.
           DISPLAY " ENTER ROLL NO ".
           ACCEPT RNO.
           DISPLAY " ENTER NAME ".
           ACCEPT NAME.
           DISPLAY " ENTER TOTAL MARKS ".
           ACCEPT MARKS.
           WRITE STUDENT-REC.
           DISPLAY " ENTER AUTHOR RECORD ? (Y/N) ".
           ACCEPT CH.
           IF CH="Y" GO TO PROCESS-PARA.
       CLOSE-PARA.
           CLOSE STUDENT.
           STOP RUN.
