       IDENTIFICATION DIVISION.
       PROGRAM-ID. PO.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 NUM-1 PIC 99 VALUE ZERO.
       01 NUM-2 PIC 99 VALUE ZERO.
       01 RESULT PIC 999 VALUE ZERO.
       PROCEDURE DIVISION.
       CALCULATE-RESULT.
           DISPLAY "ENTER NO=".
           ACCEPT NUM-1.
           DISPLAY "ENTER NO=".
           ACCEPT NUM-2.
           ADD NUM-1 NUM-2 GIVING RESULT.
           DISPLAY "THE RESULT=", RESULT.
           STOP RUN.
