       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROG.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       77 FIELD-1 PIC X(4) VALUE "RAIN".
       77 FIELD-2 PIC X(4) VALUE "ABCD".
       77 FIELD-3 PIC X(11) VALUE "JIT".
       77 FIELD-4 PIC X(11) VALUE "JIT".
       77 FIELD-5 PIC X(11) VALUE "S.R.K.N.E.C".
       77 FIELD-6 PIC X(11) VALUE "S.R.K.N.E.C".
       77 FIELD-7 PIC X(8) VALUE SPACES.
       PROCEDURE DIVISION.
       CALCULATE-RESULT.
           STRING FIELD-1, FIELD-2 DELIMITED BY "C" INTO FIELD-7.
           DISPLAY " THE STRING IS  ", FIELD-7.
           UNSTRING FIELD-4 DELIMITED BY "." INTO FIELD-5 FIELD-6.
           DISPLAY "THE UNSTRING IS  ", FIELD-5 FIELD-6.
           STOP RUN.
       
