       IDENTIFICATION DIVISION.
       PROGRAM-ID. FILES.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.
       OBJECT-COMPUTER.
       FILE-CONTROL.
           SELECT STUDENT1 ASSIGN TO DISK
           ORGANIZATION IS SEQUENTIAL
           ACCESS MODE IS SEQUENTIAL.

           SELECT STUDENT2 ASSIGN TO DISK
           ORGANIZATION IS SEQUENTIAL
           ACCESS MODE IS SEQUENTIAL.

           SELECT STUDENT3 ASSIGN TO DISK
           ORGANIZATION IS SEQUENTIAL
           ACCESS MODE IS SEQUENTIAL.

           SELECT WORK-FILE ASSIGN TO DISK.
       DATA DIVISION.
       FILE SECTION.
       FD STUDENT1
           LABEL RECORDS ARE STANDARD
           VALUE OF FILE-ID IS "STUDENT1.DAT"
           DATA RECORD IS STUDENT1-REC.
       01 STUDENT1-REC.
        02 RNO PIC 9(3).
        02 NAME PIC A(20).
        02 MARKS PIC 9(4).

       FD STUDENT2
           LABEL RECORDS ARE STANDARD
           VALUE OF FILE-ID IS "STUDENT2.DAT"
           DATA RECORD IS STUDENT2-REC.
       01 STUDENT2-REC.
        02 RNO PIC 9(3).
        02 NAME PIC A(20).
        02 MARKS PIC 9(4).

       FD STUDENT3
           LABEL RECORDS ARE STANDARD
           VALUE OF FILE-ID IS "STUDENT3.DAT"
           DATA RECORD IS STUDENT3-REC.
       01 STUDENT3-REC.
        02 SRNO PIC 9(3).
        02 SNAME PIC A(20).
        02 SMARKS PIC 9(4).
       SD WORK-FILE.

       01 WORK-REC.
        02 WRNO PIC 9(3).
        02 FILLER PIC X(24).
       WORKING-STORAGE SECTION.
       77 TRNO PIC X(3).
       77 CHOICE PIC X.
       PROCEDURE DIVISION.
       MERGE-PARA.
           MERGE WORK-FILE ON ASCENDING
           KEY WRNO USING STUDENT1, STUDENT2
           GIVING STUDENT3.
       OPEN-PARA.
           OPEN INPUT STUDENT3.
       PROCESS-PARA.
           READ STUDENT3 AT END GO TO CLOSE-PARA.
           DISPLAY "ROLL NO: ", SRNO.
           DISPLAY "NAME: ", SNAME.
           DISPLAY "MARKS: ", SMARKS.
           DISPLAY "DO YOU WANT TO CONTINUE READING? (Y/N): ".
           ACCEPT CHOICE.
           IF CHOICE = "Y"
                GO TO PROCESS-PARA.
       CLOSE-PARA.
           CLOSE STUDENT3.
           STOP RUN.
