       IDENTIFICATION DIVISION.
       PROGRAM-ID. FILES.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.
       OBJECT-COMPUTER.
       FILE-CONTROL.
           SELECT STUDENT ASSIGN TO DISK
           ORGANIZATION IS SEQUENTIAL
           ACCESS MODE IS SEQUENTIAL.

           SELECT SORTED ASSIGN TO DISK
           ORGANIZATION IS SEQUENTIAL
           ACCESS MODE IS SEQUENTIAL.

           SELECT WORK-FILE ASSIGN TO DISK.
       DATA DIVISION.
       FILE SECTION.
       FD STUDENT
           LABEL RECORDS ARE STANDARD
           VALUE OF FILE-ID "STUDENT.DAT"
           DATA RECORD IS STUDENT-REC.
       01 STUDENT-REC.
        02 RNO PIC 9(3).
        02 NAME PIC A(20).
        02 MARKS PIC 9(4).

       FD SORTED
           LABEL RECORDS ARE STANDARD
           VALUE OF FILE-ID "SORTED.DAT"
           DATA RECORD IS SORTED-REC.
       01 SORTED-REC.
        02 SRNO PIC 9(3).
        02 SNAME PIC A(20).
        02 SMARKS PIC 9(4).

       SD WORK-FILE.

       01 WORK-REC.
        02 WRNO PIC 9(3).
        02 FILLER PIC X(24).
       WORKING-STORAGE SECTION.
       77 TRNO PIC 9(3).
       77 CHOICE PIC X.
       PROCEDURE DIVISION.
       SORT-PARA.
           SORT WORK-FILE ON ASCENDING
           KEY WRNO USING STUDENT
           GIVING SORTED.
       OPEN-PARA.
           OPEN INPUT SORTED.
       PROCESS-PARA.
           READ SORTED AT END GO TO CLOSE-PARA.
           DISPLAY "ROLL NO: ", SRNO.
           DISPLAY "NAME: ", SNAME.
           DISPLAY "MARKS: ", SMARKS.
           DISPLAY "DO YOU WANT TO CONTINUE READING? (Y/N): ".
           ACCEPT CHOICE.
           IF CHOICE = "Y"
                GO TO PROCESS-PARA.
       CLOSE-PARA.
           CLOSE SORTED.
           STOP RUN.
