       IDENTIFICATION DIVISION.
       PROGRAM-ID. FILES.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.
       OBJECT-COMPUTER.
       FILE-CONTROL.
           SELECT STUDENT ASSIGN TO DISK
           ORGANIZATION IS RELATIVE
           ACCESS MODE IS RANDOM
           RELATIVE KEY IS REL-KEY.
       DATA DIVISION.
       FILE SECTION.
       FD STUDENT
           LABEL RECORDS ARE STANDARD
           VALUE OF FILE-ID "EMP.DAT"
           DATA RECORD IS STUDENT-REC.
       01 STUDENT-REC.
        02 RNO PIC 9(3).
        02 NAME PIC A(20).
        02 MARKS PIC 9(4).
       WORKING-STORAGE SECTION.
       77 REL-KEY PIC 9(4).
       77 CHOICE PIC X.
       PROCEDURE DIVISION.
       OPEN-PARA.
           OPEN I-O STUDENT.
       ASK-PARA.
           DISPLAY "ENTER THE ROLL NO TO BE MODIFIED: ".
           ACCEPT REL-KEY.
       DELETE-PARA.
           DELETE STUDENT INVALID KEY DISPLAY "RECORD NOT FOUND".
       NEXT-RECORD-PARA.
           DISPLAY "DO YOU WANT TO DELETE ANOTHER ROLL NO? (Y/N): ".
           ACCEPT CHOICE.
           IF CHOICE = "Y"
                GO TO ASK-PARA.
       CLOSE-PARA.
           CLOSE STUDENT.
           STOP RUN.
