       IDENTIFICATION DIVISION.
       PROGRAM-ID. FILES.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.
       OBJECT-COMPUTER.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT STUDENT ASSIGN TO DISK
           ORGANIZATION IS RELATIVE
           ACCESS MODE IS SEQUENTIAL
           RELATIVE KEY IS REL-KEY.
       DATA DIVISION.
       FILE SECTION.
       FD STUDENT
           LABEL RECORDS ARE STANDARD
           VALUE OF FILE-ID IS "EMP.DAT"
           DATA RECORD IS STUDENT-REC.
       01 STUDENT-REC.
        02 RNO PIC 9(3).
        02 NAME PIC A(20).
        02 MARKS PIC 9(4).
       WORKING-STORAGE SECTION.
       77 REL-KEY PIC 9(4).
       77 CHOICE PIC X.

       PROCEDURE DIVISION.
       OPEN-PARA.
           OPEN OUTPUT STUDENT.
           MOVE 0 TO REL-KEY.

       PROCESS-PARA.
           ADD 1 TO REL-KEY.

           DISPLAY "ENTER ROLL NO: ".
           ACCEPT RNO.
           DISPLAY "ENTER NAME: ".
           ACCEPT NAME.
           DISPLAY "ENTER TOTAL MARKS: ".
           ACCEPT MARKS.

           WRITE STUDENT-REC INVALID KEY DISPLAY "CANNOT WRITE RECOED".

           DISPLAY "DO YOU WANT TO CONTINUE WITH ENTRIES? (Y/N) ".
           ACCEPT CHOICE.
           IF CHOICE = "Y"
                GO TO PROCESS-PARA.
           CLOSE STUDENT.
           STOP RUN.
