       IDENTIFICATION DIVISION.
       PROGRAM-ID.
       AUTHOR.
       INSTALLATION.
       DATE-WRITTEN.
       DATE-COMPILED.
       SECURITY.

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.
       OBJECT-COMPUTER.
       SPECIAL NAMES.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
       I-D-CONTROL.


       DATA DIVISION.
       FILE-SECTION.
       WORKING-STORAGE SECTION.
       SCREEN-SECTION.
       LINKAGE-SECTION.
       REPORT-SECTION.

       PROCEDURE DIVISION.
       MAIN-PARA.
