      *TWO DISK FILES SHARING THE SAME BUFFER & RECORD AREA IN THE MEMORY
       INPUT-OUTPUT SECTION.
       FILE-CONTROL SECTION.
           SELECT FILE-1 ASSIGN TO DISK.
           SELECT FILE-2 ASSIGN TO DISK.
       I-O CONTROL.
           SAME AREA FOR FILE-1 FILE-2.

      *A MAGNETIC TAPE REEL CONTAINS 4 FILES IN THE ORDER FILE-1,FILE-2,
      *FILE-3,FILE-4 & APPLICATION PROGRAM NEEDS TO PROCESS ONLY TWO OF
      *THE FILES NAMELY FILE-2 AND FILE-4.

      INPUT-OUTPUT SECTION.
      FILE-CONTROL.
           SELECT FILE-2 ASSIGN TO TAPE.
           SELECT FILE-4 ASSIGN TO TAPE.
      I-O CONTROL.
           MULTIPLE FILE-TAPE CONTAINS FILE-2 POSITION 2 FILE-4 POSITION 4.

